; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v10 ?v8)
             (pred_7 ?v9 ?v7)
             (pred_12 ?v10 ?v7)
             (pred_11 ?v13 ?v10 )
	     (pred_3 ?v10)
             (pred_8 ?v6)
             (pred_6 ?v9)
             (pred_2 ?v7)
             (pred_4 ?v10)
             (pred_1 ?v9)
             (pred_10 ?v10)
             (pred_9 ))



(:action op_3
:parameters (?v3 ?v1 ?v5 ?v4)
:precondition (and (pred_8 ?v3) (pred_8 ?v1) (pred_6 ?v5) (pred_2 ?v4)
          (pred_5 ?v3 ?v1) (pred_7 ?v5 ?v4)
                   (pred_12 ?v1 ?v4) (pred_3 ?v3) 
                   (pred_4 ?v1) (pred_1 ?v5))
:effect (and  (pred_10 ?v1) (not (pred_4 ?v1))))


(:action op_1
:parameters (?v3 ?v12)
:precondition (and (pred_8 ?v3) (pred_8 ?v12)
               (pred_3 ?v3) (pred_5 ?v3 ?v12) (pred_10 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v3))))

(:action op_4
:parameters (?v3 ?v5)
:precondition (and (pred_8 ?v3) (pred_6 ?v5) 
                  (pred_3 ?v3) (pred_11 ?v5 ?v3) (pred_9 ))
:effect (and (pred_1 ?v5)
   (not (pred_11 ?v5 ?v3)) (not (pred_9 ))))


(:action op_2
:parameters (?v3 ?v2 ?v11)
:precondition (and (pred_8 ?v3) (pred_6 ?v2) (pred_6 ?v11)
                  (pred_3 ?v3) (pred_1 ?v11) (pred_11 ?v2 ?v3))
:effect (and (pred_1 ?v2) (pred_11 ?v11 ?v3)
        (not (pred_1 ?v11)) (not (pred_11 ?v2 ?v3))))

(:action op_5
:parameters (?v3 ?v5)
:precondition (and (pred_8 ?v3) (pred_6 ?v5) 
                  (pred_3 ?v3) (pred_1 ?v5))
:effect (and (pred_9 ) (pred_11 ?v5 ?v3) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_15 obj_01 obj_06 obj_18 obj_21 obj_14 obj_16 obj_09 obj_13 obj_20 obj_05 obj_02 obj_04 obj_10 obj_11
    obj_07 obj_19
    obj_17 obj_08 obj_12
    )

    (:init
       (pred_9)

       (pred_8 obj_03)
       (pred_8 obj_15)
       (pred_8 obj_01)
       (pred_8 obj_06)
       (pred_8 obj_18)
       (pred_8 obj_21)
       (pred_8 obj_14)
       (pred_8 obj_16)
       (pred_8 obj_09)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_8 obj_05)
       (pred_8 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_10)
       (pred_8 obj_11)
       (pred_2 obj_07)
       (pred_2 obj_19)
       (pred_6 obj_17)
       (pred_6 obj_08)
       (pred_6 obj_12)

       (pred_5 obj_03 obj_18)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_01 obj_14)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_21)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_21 obj_13)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_21 obj_18)
       (pred_5 obj_14 obj_20)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_14 obj_01)
       (pred_5 obj_14 obj_21)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_09 obj_02)
       (pred_5 obj_09 obj_13)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_13 obj_21)
       (pred_5 obj_13 obj_09)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_20 obj_05)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_02 obj_09)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_10 obj_11)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_10)
       (pred_4 obj_18)
       (pred_4 obj_05)
       (pred_4 obj_04)
       (pred_12  obj_18 obj_07)
       (pred_12  obj_05 obj_19)
       (pred_12  obj_04 obj_07)
       (pred_10 obj_03)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_14)
       (pred_10 obj_16)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_11)

       (pred_7  obj_17 obj_07)
       (pred_7  obj_08 obj_19)
       (pred_7  obj_12 obj_19)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_12 obj_14)
       (pred_3 obj_15)
    )

    (:goal (and
       (pred_11 obj_17 obj_13)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_12 obj_21)
    ))
(:constraints
  (always (not (pred_3 obj_20)))
)
)

; plan
1. (op_1 obj_15 obj_21)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_21)
   goals met: 0 of 3
2. (op_1 obj_21 obj_13)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_13)
   goals met: 0 of 3
3. (op_1 obj_13 obj_09)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_09)
   goals met: 0 of 3
4. (op_1 obj_09 obj_02)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_02)
   goals met: 0 of 3
5. (op_4 obj_02 obj_17)
   deleted: (pred_11 obj_17 obj_02) (pred_9)
   added: (pred_1 obj_17)
   goals met: 0 of 3
6. (op_1 obj_02 obj_09)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_09)
   goals met: 0 of 3
7. (op_1 obj_09 obj_13)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_13)
   goals met: 0 of 3
8. (op_5 obj_13 obj_17)
   deleted: (pred_1 obj_17)
   added: (pred_9) (pred_11 obj_17 obj_13)
   goals met: 1 of 3
9. (op_1 obj_13 obj_21)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_21)
   goals met: 1 of 3
10. (op_1 obj_21 obj_14)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_14)
   goals met: 1 of 3
11. (op_4 obj_14 obj_12)
   deleted: (pred_11 obj_12 obj_14) (pred_9)
   added: (pred_1 obj_12)
   goals met: 1 of 3
12. (op_1 obj_14 obj_21)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_21)
   goals met: 1 of 3
13. (op_1 obj_21 obj_13)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_13)
   goals met: 1 of 3
14. (op_1 obj_13 obj_09)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_09)
   goals met: 1 of 3
15. (op_5 obj_09 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_9) (pred_11 obj_12 obj_09)
   goals met: 1 of 3
16. (op_1 obj_09 obj_02)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_02)
   goals met: 1 of 3
17. (op_4 obj_02 obj_08)
   deleted: (pred_11 obj_08 obj_02) (pred_9)
   added: (pred_1 obj_08)
   goals met: 1 of 3
18. (op_1 obj_02 obj_09)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_09)
   goals met: 1 of 3
19. (op_1 obj_09 obj_13)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_13)
   goals met: 1 of 3
20. (op_5 obj_13 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_9) (pred_11 obj_08 obj_13)
   goals met: 1 of 3
21. (op_1 obj_13 obj_09)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_09)
   goals met: 1 of 3
22. (op_4 obj_09 obj_12)
   deleted: (pred_11 obj_12 obj_09) (pred_9)
   added: (pred_1 obj_12)
   goals met: 1 of 3
23. (op_1 obj_09 obj_13)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_13)
   goals met: 1 of 3
24. (op_1 obj_13 obj_21)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_21)
   goals met: 1 of 3
25. (op_5 obj_21 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_9) (pred_11 obj_12 obj_21)
   goals met: 2 of 3
26. (op_1 obj_21 obj_13)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_13)
   goals met: 2 of 3
27. (op_4 obj_13 obj_08)
   deleted: (pred_11 obj_08 obj_13) (pred_9)
   added: (pred_1 obj_08)
   goals met: 2 of 3
28. (op_1 obj_13 obj_21)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_21)
   goals met: 2 of 3
29. (op_1 obj_21 obj_14)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_14)
   goals met: 2 of 3
30. (op_1 obj_14 obj_16)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_16)
   goals met: 2 of 3
31. (op_3 obj_16 obj_05 obj_08 obj_19)
   deleted: (pred_4 obj_05)
   added: (pred_10 obj_05)
   goals met: 2 of 3
32. (op_1 obj_16 obj_05)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_05)
   goals met: 2 of 3
33. (op_5 obj_05 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_9) (pred_11 obj_08 obj_05)
   goals met: 3 of 3
